app/controllers/movies_controller.rb

  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")
    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  ORDER BY created_at DESC  [["movie_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]

  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "movie_length", "movie_cast", "director", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_file_name", "Pokiri_movie_poster.jpg"], ["image_file_size", 25591], ["image_updated_at", "2016-09-11 02:31:32.443381"], ["updated_at", "2016-09-11 02:31:32.496439"], ["id", 1]]

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]