app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 2], ["comment", "not good"], ["user_id", 1], ["movie_id", 1], ["created_at", "2016-09-10 19:53:43.345261"], ["updated_at", "2016-09-10 19:53:43.345261"]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id


    respond_to do |format|
      if @review.save

DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @review.destroy

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_review
      @review = Review.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_movie
      @movie = Movie.find(params[:movie_id])